# Self-study --- Working with Text & Time Data

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

## PRACTISE-01

In [4]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
df.embark_town.str.lower().head()

0    southampton
1      cherbourg
2    southampton
3    southampton
4    southampton
Name: embark_town, dtype: object

In [10]:
df.sex.str.upper().head()

0      MALE
1    FEMALE
2    FEMALE
3    FEMALE
4      MALE
Name: sex, dtype: object

In [13]:
df.sex.head(2).str.islower()

0    True
1    True
Name: sex, dtype: bool

In [14]:
df.embark_town.head(3).str.isupper()

0    False
1    False
2    False
Name: embark_town, dtype: bool

In [22]:
df.pclass.head().info()

<class 'pandas.core.series.Series'>
RangeIndex: 5 entries, 0 to 4
Series name: pclass
Non-Null Count  Dtype
--------------  -----
5 non-null      int64
dtypes: int64(1)
memory usage: 168.0 bytes

In [28]:
df.pclass.head().astype('string').str.isnumeric()

0    True
1    True
2    True
3    True
4    True
Name: pclass, dtype: boolean

In [34]:
df.age.isna()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: age, Length: 891, dtype: bool

In [38]:
df.age.replace(np.nan,'UNKNOWN')

0         22.0
1         38.0
2         26.0
3         35.0
4         35.0
        ...
886       27.0
887       19.0
888    UNKNOWN
889       26.0
890       32.0
Name: age, Length: 891, dtype: object

In [45]:
df[df.sibsp.astype('string').str.contains('1')].head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [46]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [48]:
df.sex.str.split('male').head()

0      [, ]
1    [fe, ]
2    [fe, ]
3    [fe, ]
4      [, ]
Name: sex, dtype: object

In [52]:
df.sex.str.strip('le').head()

0      ma
1    fema
2    fema
3    fema
4      ma
Name: sex, dtype: object

In [55]:
df.embark_town.str.find('southampton')

0      1.0
1     -1.0
2      1.0
3      1.0
4      1.0
      ...
886    1.0
887    1.0
888    1.0
889   -1.0
890   -1.0
Name: embark_town, Length: 891, dtype: float64

In [60]:
df.embark_town.str.findall('southampton')

0      []
1      []
2      []
3      []
4      []
       ..
886    []
887    []
888    []
889    []
890    []
Name: embark_town, Length: 891, dtype: object

In [61]:
df.embark_town.str.findall('Southampton')

0      [Southampton]
1                 []
2      [Southampton]
3      [Southampton]
4      [Southampton]
           ...
886    [Southampton]
887    [Southampton]
888    [Southampton]
889               []
890               []
Name: embark_town, Length: 891, dtype: object

## PRACTISE-02

In [62]:
orders = pd.read_table('http://bit.ly/chiporders')

In [63]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [64]:
orders.item_name.str.upper()

0                CHIPS AND FRESH TOMATO SALSA
1                                        IZZE
2                            NANTUCKET NECTAR
3       CHIPS AND TOMATILLO-GREEN CHILI SALSA
4                                CHICKEN BOWL
                        ...
4617                            STEAK BURRITO
4618                            STEAK BURRITO
4619                       CHICKEN SALAD BOWL
4620                       CHICKEN SALAD BOWL
4621                       CHICKEN SALAD BOWL
Name: item_name, Length: 4622, dtype: object

In [66]:
orders.item_name.str.contains('Chicken')

0       False
1       False
2       False
3       False
4        True
        ...
4617    False
4618    False
4619     True
4620     True
4621     True
Name: item_name, Length: 4622, dtype: bool

In [67]:
orders[orders.item_name.str.contains('Chicken')]

,order_id,quantity,item_name,choice_description,item_price
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
11,6,1,Chicken Crispy Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75
12,6,1,Chicken Soft Tacos,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",$8.75
13,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25
...,...,...,...,...,...
4604,1828,1,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",$8.75
4615,1832,1,Chicken Soft Tacos,"[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream]]",$8.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [71]:
orders.choice_description.str.replace('[','').str.replace(']','')

C:\Users\Bilal\AppData\Local\Temp\ipykernel_9956\1221515355.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders.choice_description.str.replace('[','').str.replace(']','')

0                                                     NaN
1                                              Clementine
2                                                   Apple
3                                                     NaN
4       Tomatillo-Red Chili Salsa (Hot), Black Beans, ...
                              ...
4617    Fresh Tomato Salsa, Rice, Black Beans, Sour Cr...
4618    Fresh Tomato Salsa, Rice, Sour Cream, Cheese, ...
4619    Fresh Tomato Salsa, Fajita Vegetables, Pinto B...
4620       Fresh Tomato Salsa, Fajita Vegetables, Lettuce
4621    Fresh Tomato Salsa, Fajita Vegetables, Pinto B...
Name: choice_description, Length: 4622, dtype: object

In [80]:
orders.choice_description

0                                                     NaN
1                                            [Clementine]
2                                                 [Apple]
3                                                     NaN
4       [Tomatillo-Red Chili Salsa (Hot), [Black Beans...
                              ...
4617    [Fresh Tomato Salsa, [Rice, Black Beans, Sour ...
4618    [Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...
4619    [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...
4620    [Fresh Tomato Salsa, [Fajita Vegetables, Lettu...
4621    [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...
Name: choice_description, Length: 4622, dtype: object

In [99]:
orders.choice_description.str.replace('[\[\]]','')

C:\Users\Bilal\AppData\Local\Temp\ipykernel_9956\1170995540.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  orders.choice_description.str.replace('[\[\]]','')

0                                                     NaN
1                                              Clementine
2                                                   Apple
3                                                     NaN
4       Tomatillo-Red Chili Salsa (Hot), Black Beans, ...
                              ...
4617    Fresh Tomato Salsa, Rice, Black Beans, Sour Cr...
4618    Fresh Tomato Salsa, Rice, Sour Cream, Cheese, ...
4619    Fresh Tomato Salsa, Fajita Vegetables, Pinto B...
4620       Fresh Tomato Salsa, Fajita Vegetables, Lettuce
4621    Fresh Tomato Salsa, Fajita Vegetables, Pinto B...
Name: choice_description, Length: 4622, dtype: object

In [103]:
orders.choice_description.str.replace('e','')

0                                                     NaN
1                                               [Clmntin]
2                                                  [Appl]
3                                                     NaN
4       [Tomatillo-Rd Chili Salsa (Hot), [Black Bans, ...
                              ...
4617    [Frsh Tomato Salsa, [Ric, Black Bans, Sour Cra...
4618    [Frsh Tomato Salsa, [Ric, Sour Cram, Chs, Lttu...
4619    [Frsh Tomato Salsa, [Fajita Vgtabls, Pinto Ban...
4620         [Frsh Tomato Salsa, [Fajita Vgtabls, Lttuc]]
4621    [Frsh Tomato Salsa, [Fajita Vgtabls, Pinto Ban...
Name: choice_description, Length: 4622, dtype: object

## PRACTISE - 03

In [104]:
df1 = pd.read_excel('text_exercise.xlsx')
df1

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [106]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      object
 1   staff       8 non-null      object
 2   department  8 non-null      object
 3   job         8 non-null      object
 4   salary      8 non-null      object
 5   age         8 non-null      object
dtypes: object(6)
memory usage: 512.0+ bytes

In [108]:
df1.sample(4)

      id         staff department                 job       salary age
6  E0005   Adrian STAR         IT      data scientist   "$135,000"  40
1  M0002    JOHN BLACK         IT             manager   "$180,000"  48
5  E0004   OSCAR SMİTH         IT  frontend developer   "$120,000"  32
7  E0006  Albert simon         IT      data scientist  125000dolar  35

In [109]:
df1['staff'].str.lower()

0         tom blue
1       john black
2    micheal brown
3     jason walker
4       alex green
5     oscar smi̇th
6      adrian star
7     albert simon
Name: staff, dtype: object

In [110]:
df1['staff'].str.upper()

0         TOM BLUE
1       JOHN BLACK
2    MICHEAL BROWN
3     JASON WALKER
4       ALEX GREEN
5      OSCAR SMİTH
6      ADRIAN STAR
7     ALBERT SIMON
Name: staff, dtype: object

In [111]:
df1['staff'].str.title()

0         Tom Blue
1       John Black
2    Micheal Brown
3     Jason Walker
4       Alex Green
5     Oscar Smi̇th
6      Adrian Star
7     Albert Simon
Name: staff, dtype: object

In [112]:
df1['staff'].str.swapcase()

0         tOM blue
1       john black
2    mICHEAL bROWN
3     JASON WALKER
4       aLEX gREEN
5     oscar smi̇th
6      aDRIAN star
7     aLBERT SIMON
Name: staff, dtype: object

In [114]:
df1['staff'].str.capitalize()

0         Tom blue
1       John black
2    Micheal brown
3     Jason walker
4       Alex green
5     Oscar smi̇th
6      Adrian star
7     Albert simon
Name: staff, dtype: object

In [118]:
arr = np.array(['ali','veli','20'])
dframe = pd.DataFrame(arr,columns=['isim'])
dframe

   isim
0   ali
1  veli
2    20

In [119]:
dframe.isim.str.swapcase()

0     ALI
1    VELI
2      20
Name: isim, dtype: object

In [122]:
df1

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [124]:
df1.job

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

In [126]:
df1.job.str.isalpha()

0     True
1     True
2    False
3     True
4    False
5    False
6    False
7    False
Name: job, dtype: bool

In [128]:
df1.age.str.isnumeric()

0      NaN
1      NaN
2      NaN
3      NaN
4    False
5      NaN
6      NaN
7      NaN
Name: age, dtype: object

In [129]:
df.age.astype('string').str.isnumeric()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     <NA>
889    False
890    False
Name: age, Length: 891, dtype: boolean

In [131]:
df1.salary.str.isalnum()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

In [133]:
df1.salary

0     "$150,000"
1     "$180,000"
2     "$150,000"
3    130000dolar
4     "$110,000"
5     "$120,000"
6     "$135,000"
7    125000dolar
Name: salary, dtype: object

In [135]:
df1.job.str.startswith('d')

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

In [139]:
df1.job.str.endswith('per')

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
Name: job, dtype: bool

In [140]:
df1[['job']][df1.job.str.endswith('per')]

                  job
4   backend developer
5  frontend developer

In [145]:
df1.loc[df1.job.str.endswith('per'),['job']]

                  job
4   backend developer
5  frontend developer

In [146]:
df1.job.str.contains('data')

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

In [147]:
df1.job.str.contains('[a-z]+')

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
Name: job, dtype: bool

In [149]:
df1[df1.job.str.contains('data')]

      id          staff department             job       salary age
2  E0001  Micheal Brown         IT  data scientist   "$150,000"  35
6  E0005    Adrian STAR         IT  data scientist   "$135,000"  40
7  E0006   Albert simon         IT  data scientist  125000dolar  35

In [153]:
df1.loc[df1.job.str.contains('data'), 'department'] = 'DS'
df1

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         DS      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         DS      data scientist   "$135,000"  40
7  E0006   Albert simon         DS      data scientist  125000dolar  35

In [161]:
df1.salary.str.strip('\"').str.lstrip('$').str.rstrip('dolar')

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [167]:
df1['salary'] =   df1.salary.str.strip('\"dolar$').str.replace(',','').astype(int)

In [168]:
df1

      id          staff department                 job  salary age
0  M0001       Tom BLUE         HR             manager  150000  52
1  M0002     JOHN BLACK         IT             manager  180000  48
2  E0001  Micheal Brown         DS      data scientist  150000  35
3  E0002   jason walker         HR           recruiter  130000  38
4  E0003     Alex Green         IT   backend developer  110000   -
5  E0004    OSCAR SMİTH         IT  frontend developer  120000  32
6  E0005    Adrian STAR         DS      data scientist  135000  40
7  E0006   Albert simon         DS      data scientist  125000  35

In [169]:
df1.age

0    52
1    48
2    35
3    38
4     -
5    32
6    40
7    35
Name: age, dtype: object

In [172]:
df1['age'] = df1.age.replace('-',np.nan)    # using regular replace in order to replace value with float value(np.nan)
df1.age

0    52.0
1    48.0
2    35.0
3    38.0
4     NaN
5    32.0
6    40.0
7    35.0
Name: age, dtype: float64

In [174]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      object
 1   staff       8 non-null      object
 2   department  8 non-null      object
 3   job         8 non-null      object
 4   salary      8 non-null      int32
 5   age         7 non-null      float64
dtypes: float64(1), int32(1), object(4)
memory usage: 480.0+ bytes

In [175]:
df1.staff

0         Tom BLUE
1       JOHN BLACK
2    Micheal Brown
3     jason walker
4       Alex Green
5      OSCAR SMİTH
6      Adrian STAR
7     Albert simon
Name: staff, dtype: object

In [179]:
df1.staff.str.title().str.split(pat = ' ')

0         [Tom, Blue]
1       [John, Black]
2    [Micheal, Brown]
3     [Jason, Walker]
4       [Alex, Green]
5     [Oscar, Smi̇th]
6      [Adrian, Star]
7     [Albert, Simon]
Name: staff, dtype: object

In [184]:
df1['first_name'] = df1.staff.str.title().str.split(pat = ' ').str[0]
df1['last_name'] = df1.staff.str.title().str.split(pat = ' ').str[1]
df1

,id,staff,department,job,salary,age,first_name,last_name
0,M0001,Tom BLUE,HR,manager,150000,52.0,Tom,Blue
1,M0002,JOHN BLACK,IT,manager,180000,48.0,John,Black
2,E0001,Micheal Brown,DS,data scientist,150000,35.0,Micheal,Brown
3,E0002,jason walker,HR,recruiter,130000,38.0,Jason,Walker
4,E0003,Alex Green,IT,backend developer,110000,NaN,Alex,Green
5,E0004,OSCAR SMİTH,IT,frontend developer,120000,32.0,Oscar,Smi̇th
6,E0005,Adrian STAR,DS,data scientist,135000,40.0,Adrian,Star
7,E0006,Albert simon,DS,data scientist,125000,35.0,Albert,Simon

In [185]:
df1.drop('staff' , axis=1 ,inplace=True)

In [186]:
df1

      id department                 job  salary   age first_name last_name
0  M0001         HR             manager  150000  52.0        Tom      Blue
1  M0002         IT             manager  180000  48.0       John     Black
2  E0001         DS      data scientist  150000  35.0    Micheal     Brown
3  E0002         HR           recruiter  130000  38.0      Jason    Walker
4  E0003         IT   backend developer  110000   NaN       Alex     Green
5  E0004         IT  frontend developer  120000  32.0      Oscar    Smi̇th
6  E0005         DS      data scientist  135000  40.0     Adrian      Star
7  E0006         DS      data scientist  125000  35.0     Albert     Simon